In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

In [5]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = { 'a' : 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [15]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [17]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
series1 = pd.Series([1, 2, 3, 4], index = ['USA', 'GERMANY', 'USSR', 'JAPAN'])
series1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [21]:
series2 = pd.Series([1, 2, 5, 4], index = ['USA', 'GERMANY', 'ITALY', 'JAPAN'])
series2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [23]:
series1 + series2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

In [27]:
series1['USA']

1

 Dataframes - Two dimensional hetrogeneous data more than one column, Series - One Dimensional homogenous

In [29]:
temp = np.random.randint(20, 100, 20)
name = np.random.choice(['Anu', 'Aravind', 'Ajay', 'Achu',], 20)
random = np.random.choice([10, 11, 12, 13, 14], 20)

In [31]:
a = list(zip(temp, name, random))

In [33]:
df = pd.DataFrame(data = a, columns = ['temp', 'name', 'random'])
df

    temp     name  random
0     47     Achu      14
1     25     Achu      11
2     59      Anu      11
3     74     Ajay      12
4     74  Aravind      14
5     62      Anu      10
6     24      Anu      10
7     33      Anu      10
8     74     Achu      11
9     90      Anu      14
10    83     Ajay      13
11    39     Ajay      13
12    98  Aravind      14
13    21  Aravind      11
14    61     Ajay      11
15    31  Aravind      10
16    63     Achu      11
17    71      Anu      13
18    59     Achu      12
19    99      Anu      11

In [35]:
np.random.seed(101)

In [37]:
temp = np.random.randint(20, 100, 20)
name = np.random.choice(['Anu', 'Aravind', 'Ajay', 'Achu',], 20)
random = np.random.choice([10, 11, 12, 13, 14], 20)
a = list(zip(temp, name, random))
df = pd.DataFrame(data = a, columns = ['temp', 'name', 'random'])
df

    temp     name  random
0     31      Anu      14
1     90      Anu      12
2     83  Aravind      14
3     95     Achu      10
4     29     Ajay      11
5     97     Ajay      14
6     60      Anu      12
7     24     Achu      14
8     83     Achu      10
9     60     Achu      14
10    80      Anu      12
11    84  Aravind      14
12    25     Achu      11
13    32  Aravind      10
14    60     Achu      13
15    69      Anu      13
16    28     Ajay      11
17    49      Anu      10
18    79     Achu      14
19    54     Achu      14

In [39]:
from numpy.random import randn

In [41]:
df = pd.DataFrame(randn(5, 4), index ='A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  1.029048 -0.272079  2.060797 -1.046867
B -2.273739  1.218096 -0.662684  0.420491
C -0.260526  0.389780  0.164244 -0.371581
D -0.050739  2.434601  1.241440  0.190978
E -1.245347  0.952183  1.301380 -0.167320

In [43]:
df['W']

A    1.029048
B   -2.273739
C   -0.260526
D   -0.050739
E   -1.245347
Name: W, dtype: float64

In [45]:
type(df['W'])

pandas.core.series.Series

In [47]:
df['W']

A    1.029048
B   -2.273739
C   -0.260526
D   -0.050739
E   -1.245347
Name: W, dtype: float64

In [49]:
type(df[['W', 'Z']])

pandas.core.frame.DataFrame

In [51]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  1.029048 -0.272079  2.060797 -1.046867  3.089845
B -2.273739  1.218096 -0.662684  0.420491 -2.936423
C -0.260526  0.389780  0.164244 -0.371581 -0.096282
D -0.050739  2.434601  1.241440  0.190978  1.190701
E -1.245347  0.952183  1.301380 -0.167320  0.056033

In [53]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  1.029048 -0.272079  2.060797 -1.046867
B -2.273739  1.218096 -0.662684  0.420491
C -0.260526  0.389780  0.164244 -0.371581
D -0.050739  2.434601  1.241440  0.190978
E -1.245347  0.952183  1.301380 -0.167320

In [55]:
df

          W         X         Y         Z       new
A  1.029048 -0.272079  2.060797 -1.046867  3.089845
B -2.273739  1.218096 -0.662684  0.420491 -2.936423
C -0.260526  0.389780  0.164244 -0.371581 -0.096282
D -0.050739  2.434601  1.241440  0.190978  1.190701
E -1.245347  0.952183  1.301380 -0.167320  0.056033

In [57]:
df.drop('new', axis = 1, inplace = True)
df

          W         X         Y         Z
A  1.029048 -0.272079  2.060797 -1.046867
B -2.273739  1.218096 -0.662684  0.420491
C -0.260526  0.389780  0.164244 -0.371581
D -0.050739  2.434601  1.241440  0.190978
E -1.245347  0.952183  1.301380 -0.167320

In [59]:
df.drop('A', axis = 0, inplace = True)
df

          W         X         Y         Z
B -2.273739  1.218096 -0.662684  0.420491
C -0.260526  0.389780  0.164244 -0.371581
D -0.050739  2.434601  1.241440  0.190978
E -1.245347  0.952183  1.301380 -0.167320

In [61]:
newdf = df.drop('E', axis = 0, inplace = True)
newdf

In [63]:
df

          W         X         Y         Z
B -2.273739  1.218096 -0.662684  0.420491
C -0.260526  0.389780  0.164244 -0.371581
D -0.050739  2.434601  1.241440  0.190978

In [65]:
df.loc['B']

W   -2.273739
X    1.218096
Y   -0.662684
Z    0.420491
Name: B, dtype: float64

In [67]:
df.iloc[2]

W   -0.050739
X    2.434601
Y    1.241440
Z    0.190978
Name: D, dtype: float64

In [69]:
df.loc['B', 'Y']

-0.6626842470069781

In [71]:
df = pd.DataFrame(randn(5, 4), index ='A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  0.050221  1.556790  1.345434  1.501737
B -0.633348 -0.487281 -1.647469  0.543758
C -1.210949 -0.365949  0.632181 -0.393214
D -1.826066  1.257824  1.291497 -0.200139
E  1.255905 -0.621076 -0.090848  0.439521

In [73]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.050221  1.345434
B -0.633348 -1.647469

In [75]:
df.set_index('Y', inplace = True)
df

                  W         X         Z
Y
 1.345434  0.050221  1.556790  1.501737
-1.647469 -0.633348 -0.487281  0.543758
 0.632181 -1.210949 -0.365949 -0.393214
 1.291497 -1.826066  1.257824 -0.200139
-0.090848  1.255905 -0.621076  0.439521

In [77]:
df.sort_index(axis = 0, ascending = True)

                  W         X         Z
Y
-1.647469 -0.633348 -0.487281  0.543758
-0.090848  1.255905 -0.621076  0.439521
 0.632181 -1.210949 -0.365949 -0.393214
 1.291497 -1.826066  1.257824 -0.200139
 1.345434  0.050221  1.556790  1.501737

In [79]:
df.sort_index(axis = 1, ascending = False)

                  Z         X         W
Y
 1.345434  1.501737  1.556790  0.050221
-1.647469  0.543758 -0.487281 -0.633348
 0.632181 -0.393214 -0.365949 -1.210949
 1.291497 -0.200139  1.257824 -1.826066
-0.090848  0.439521 -0.621076  1.255905

In [81]:
df.sort_values('X', ascending = False)

                  W         X         Z
Y
 1.345434  0.050221  1.556790  1.501737
 1.291497 -1.826066  1.257824 -0.200139
 0.632181 -1.210949 -0.365949 -0.393214
-1.647469 -0.633348 -0.487281  0.543758
-0.090848  1.255905 -0.621076  0.439521

In [83]:
df.reset_index(inplace = True)
df

          Y         W         X         Z
0  1.345434  0.050221  1.556790  1.501737
1 -1.647469 -0.633348 -0.487281  0.543758
2  0.632181 -1.210949 -0.365949 -0.393214
3  1.291497 -1.826066  1.257824 -0.200139
4 -0.090848  1.255905 -0.621076  0.439521

In [85]:
#conditional selection
df > 0

       Y      W      X      Z
0   True   True   True   True
1  False  False  False   True
2   True  False  False  False
3   True  False   True  False
4  False   True  False   True

In [87]:
df[df>0]

          Y         W         X         Z
0  1.345434  0.050221  1.556790  1.501737
1       NaN       NaN       NaN  0.543758
2  0.632181       NaN       NaN       NaN
3  1.291497       NaN  1.257824       NaN
4       NaN  1.255905       NaN  0.439521

In [89]:
df[df['W']>0]

          Y         W         X         Z
0  1.345434  0.050221  1.556790  1.501737
4 -0.090848  1.255905 -0.621076  0.439521

In [91]:
df[df['W']>0]['Y']

0    1.345434
4   -0.090848
Name: Y, dtype: float64

In [93]:
df[df['W']>0][['Y', 'X']]

          Y         X
0  1.345434  1.556790
4 -0.090848 -0.621076

In [95]:
df[(df['W']>0) & (df['Y']>1)]

          Y         W        X         Z
0  1.345434  0.050221  1.55679  1.501737

In [97]:
a = [1, 2, 3, 4, 5]
b = ['a' ,'b', 'c' ,'d' , 'e']
df = pd.DataFrame(a, b, columns = ['A'])
df

   A
a  1
b  2
c  3
d  4
e  5

In [99]:
dmap = {1 : 'One', 2 : 'Two', 3 : 'Three', 4 : 'Four'}
df['A'].map(dmap)

a      One
b      Two
c    Three
d     Four
e      NaN
Name: A, dtype: object